In [1]:
# Importing Pandas and Numpy libraries
import pandas as pd
import numpy as np

In [2]:
# creating Series
sales1 = pd.Series([100, 200, 300, 400], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales2 = pd.Series([150, 240, 410, 490], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])
sales3 = pd.Series([300, 400, 500, 600], index=['Microsoft', 'Facebook', 'Amazon', 'Google'])

In [3]:
# Creating Dataframe
dataframe1 = pd.DataFrame({2017: sales1, 2018: sales2, 2019: sales3})
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [4]:
dataframe1 * 2

           2017  2018  2019
Microsoft   200   300   600
Facebook    400   480   800
Amazon      600   820  1000
Google      800   980  1200

In [6]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [7]:
dataframe1 * 10 / 100 # 10% of every element

           2017  2018  2019
Microsoft  10.0  15.0  30.0
Facebook   20.0  24.0  40.0
Amazon     30.0  41.0  50.0
Google     40.0  49.0  60.0

In [9]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [8]:
v1 = dataframe1.iloc[0] # Microsoft selected.
v1

2017    100
2018    150
2019    300
Name: Microsoft, dtype: int64

In [10]:
dataframe1 - v1 # Microsoft - Microsoft

           2017  2018  2019
Microsoft     0     0     0
Facebook    100    90   100
Amazon      200   260   200
Google      300   340   300

In [11]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [12]:
dataframe2 = v1 - dataframe1 # v1 will be substracted from every element.
dataframe2

           2017  2018  2019
Microsoft     0     0     0
Facebook   -100   -90  -100
Amazon     -200  -260  -200
Google     -300  -340  -300

In [13]:
v2 = v1[0:2] # only contains Microsoft becz v1 has Microsoft only.
v2

2017    100
2018    150
Name: Microsoft, dtype: int64

In [14]:
v2 + dataframe2

            2017   2018  2019
Microsoft  100.0  150.0   NaN
Facebook     0.0   60.0   NaN
Amazon    -100.0 -110.0   NaN
Google    -200.0 -190.0   NaN

In [16]:
dataframe2 = dataframe1[0:2]
dataframe2

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400

In [17]:
dataframe1

           2017  2018  2019
Microsoft   100   150   300
Facebook    200   240   400
Amazon      300   410   500
Google      400   490   600

In [18]:
dataframe1 + dataframe2

            2017   2018   2019
Amazon       NaN    NaN    NaN
Facebook   400.0  480.0  800.0
Google       NaN    NaN    NaN
Microsoft  200.0  300.0  600.0

In [20]:
dataframe1.loc['Facebook',2018]

240

In [22]:
dataframe3 = dataframe1[0:2:1] [[2017]]
dataframe3

           2017
Microsoft   100
Facebook    200